<?php

$a = 15;

if ($a > 10) {
    $a += 100;
} else {
    $a -= 30;
}

// -----------------

$a = 8;

if ($a % 2 === 0) {
    $a /= 2;
} else {
    $a *= 3;
}

// -------------------
$a = 40;

if ($a < 50) {
    $a *= $a;
} elseif($a > 10 && $a < 30) {
    $a = 0;
} else {
    echo 'Ошибка!';
    die;
}

// ------------------
$a = 15;
$b = 20;

if ($a > $b) {
    echo $a;
} elseif ($b > $a) {
    echo $b;
}

// ------------------
$a = 19;
$b = 143;

if ($b - $a) {
    echo 'Da';
} else {
    echo 'No';
}
// ------------------
$a = 4;
$b = 8;

if (!($a - $b || $b - $a > 20)) {
    echo 'yes';
} else {
    echo 'no';
}
